---
kind: type
id: T:Autodesk.Revit.DB.TableCellCombinedParameterData
source: html/f2303148-6e5e-d143-3725-3ac12c04ea86.htm
---
# Autodesk.Revit.DB.TableCellCombinedParameterData

The TableCellCombinedParameterData stores the data for combined parameters

## Syntax (C#)
```csharp
public class TableCellCombinedParameterData : IDisposable
```